In [1]:
import numpy as np
import pandas as pd

In [8]:
Q1 = np.array([2, np.nan, 6, 7, 3, 2])
Q1

array([ 2., nan,  6.,  7.,  3.,  2.])

In [36]:
Q2 = np.nansum(Q1)
Q2

20.0

In [13]:
Q3 = pd.Series([4, 5, 2, np.nan, 1, np.nan])
Q3

0    4.0
1    5.0
2    2.0
3    NaN
4    1.0
5    NaN
dtype: float64

In [14]:
Q4 = Q3.isnull()
Q4

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [25]:
Q5 = pd.Series([4, 5, 2, np.nan, 1, np.nan])
Q5 = Q5[Q5.notnull()]
Q5

0    4.0
1    5.0
2    2.0
4    1.0
dtype: float64

In [21]:
Q6 = pd.Series([4, 5, 2, np.nan, 1, np.nan])
Q6 = Q6.fillna(100)
Q6

0      4.0
1      5.0
2      2.0
3    100.0
4      1.0
5    100.0
dtype: float64

In [23]:
Q7 = pd.DataFrame([[4, 5, 2, 9, 1, 8],
                   [5, 6, None, 3, None, 2],
                   [6, None, 7, None, 4, 3]])
Q7 = Q7.fillna(100)
Q7

   0      1      2      3      4  5
0  4    5.0    2.0    9.0    1.0  8
1  5    6.0  100.0    3.0  100.0  2
2  6  100.0    7.0  100.0    4.0  3

In [27]:
Q8 = pd.Series([4, 5, 2, np.nan, 1, np.nan])
Q8 = Q8.dropna()
Q8

0    4.0
1    5.0
2    2.0
4    1.0
dtype: float64

In [29]:
Q9 = pd.DataFrame([[4, 5, 2, 9, 1, 8],
                   [5, 6, None, 3, None, 2],
                   [6, None, 7, None, 4, 3]])
Q9 = Q9.dropna(axis='columns') 
Q9

   0  5
0  4  8
1  5  2
2  6  3

In [31]:
Q10 =pd.DataFrame([[4, 5, 2, 9, 1, 8],
                   [5, 6, None, 3, None, 2],
                   [6, None, 7, None, 4, 3]])
Q10 = Q10.dropna()
Q10

   0    1    2    3    4  5
0  4  5.0  2.0  9.0  1.0  8

In [33]:
Q11 = pd.DataFrame([[4, 5, 2, 9, 1, 8],
                   [5, 6, None, 3, None, 2],
                   [6, None, 7, None, 4, 3]])
Q11 = Q11.dropna(thresh = 5)
Q11

   0    1    2    3    4  5
0  4  5.0  2.0  9.0  1.0  8

In [34]:
Q12 =pd.DataFrame([[4, 5, 2, 9, 1, 8],
                   [5, 6, None, 3, None, 2],
                   [6, None, 7, None, 4, 3]])
Q12[6] = np.nan
Q12

   0    1    2    3    4  5   6
0  4  5.0  2.0  9.0  1.0  8 NaN
1  5  6.0  NaN  3.0  NaN  2 NaN
2  6  NaN  7.0  NaN  4.0  3 NaN